Blaze_Test-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Blaze_Test-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Blaze_Test-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Blaze_Test-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: login
      actions:
      - resizeWindow(1920,880)
      - go(https://qamidhl.herokuapp.com/wp/wp-login.php?loggedout=true)
      - clickByID(user_login)
      - typeByID(user_login): "qamidl1"
      - clickByID(user_pass)
      - typeSecretID(user_pass): "******"
      - clickByID(wp-submit)
    - label: add comment
      actions:
      - openWindow(https://github.com/netology-code/loadqa-homeworks/blob/main/3.Load%20web/homework_lecture3.md)
      - switchWindow(win_ser_1)
      - go(https://qamidhl.herokuapp.com/?p=1)
      - switchWindow(win_ser_2)
      - clickByID(comment)
      - typeByID(comment): "Hello world!"
      - clickByID(submit)

  Blaze_Test-Http:
    headers:
      sec-ch-ua: '"Chromium";v="106", "Google Chrome";v="106", "Not;A=Brand";v="99"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/106.0.0.0 Safari/537.36'
    requests:
      - transaction: login
        force-parent-sample: false
        do:
          - url: 'https://qamidhl.herokuapp.com/wp/wp-login.php'
            method: POST
            label: 'https://qamidhl.herokuapp.com/wp/wp-login.php'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
            body:
              log: qamidl1
              pwd: '******'
              redirect_to: 'https://qamidhl.herokuapp.com/wp/wp-admin/'
              testcookie: '1'
              wp-submit: Log In
      - transaction: add comment
        force-parent-sample: false
        do:
          - url: 'https://qamidhl.herokuapp.com/wp/wp-admin/admin-ajax.php'
            method: POST
            label: 'https://qamidhl.herokuapp.com/wp/wp-admin/admin-ajax.php'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              X-Requested-With: XMLHttpRequest
            body:
              _nonce: 5bb3eb165a
              action: heartbeat
              has_focus: 'true'
              interval: '60'
              screen_id: dashboard
          - url: 'https://qamidhl.herokuapp.com/wp/wp-comments-post.php'
            method: POST
            label: 'https://qamidhl.herokuapp.com/wp/wp-comments-post.php'
            think-time: 44890ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
            body:
              comment: 'Hello world!'
              comment_parent: '0'
              comment_post_ID: '1'
              submit: Post Comment